### Ordinal Number Encoding

In [1]:
import datetime

In [6]:
today_date = datetime.datetime.today()

In [7]:
today_date

datetime.datetime(2023, 8, 21, 9, 30, 6, 99159)

In [8]:
## printing previous dates
today_date-datetime.timedelta(3)

datetime.datetime(2023, 8, 18, 9, 30, 6, 99159)

In [14]:
### list comprehensions
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [16]:
# conveting the days into dataframe
import pandas as pd
data = pd.DataFrame(days, columns = ["Days"])

In [18]:
data.head()

                        Days
0 2023-08-21 09:30:06.099159
1 2023-08-20 09:30:06.099159
2 2023-08-19 09:30:06.099159
3 2023-08-18 09:30:06.099159
4 2023-08-17 09:30:06.099159

In [24]:
# extract weekday names using strftime

data['weekday'] = data['Days'].apply(lambda x: x.strftime('%A'))

In [26]:
data.head()

                        Days   weekday
0 2023-08-21 09:30:06.099159    Monday
1 2023-08-20 09:30:06.099159    Sunday
2 2023-08-19 09:30:06.099159  Saturday
3 2023-08-18 09:30:06.099159    Friday
4 2023-08-17 09:30:06.099159  Thursday

In [31]:
# encoding for the weekday 

dictionary = {'Monday':1, 'Tuesday':2, 'Wednesday':3, 'Thursday': 4, 'Friday': 5 , 'Saturday': 6, 'Sunday':7
    
}

In [32]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [33]:
# using map function to convert the data into a number as the ditionary has
data['weekday_ordinal'] = data['weekday'].map(dictionary)

In [35]:
data

                         Days    weekday  weekday_ordinal
0  2023-08-21 09:30:06.099159     Monday                1
1  2023-08-20 09:30:06.099159     Sunday                7
2  2023-08-19 09:30:06.099159   Saturday                6
3  2023-08-18 09:30:06.099159     Friday                5
4  2023-08-17 09:30:06.099159   Thursday                4
5  2023-08-16 09:30:06.099159  Wednesday                3
6  2023-08-15 09:30:06.099159    Tuesday                2
7  2023-08-14 09:30:06.099159     Monday                1
8  2023-08-13 09:30:06.099159     Sunday                7
9  2023-08-12 09:30:06.099159   Saturday                6
10 2023-08-11 09:30:06.099159     Friday                5
11 2023-08-10 09:30:06.099159   Thursday                4
12 2023-08-09 09:30:06.099159  Wednesday                3
13 2023-08-08 09:30:06.099159    Tuesday                2
14 2023-08-07 09:30:06.099159     Monday                1

#### Count Or Frequency Enconding

In [37]:
 train_set = pd.read_csv('adult_csv.csv')

In [45]:
train_set.head()

   age         workclass  fnlwgt  ... hoursperweek  native-country  class
0    2         State-gov   77516  ...            2   United-States  <=50K
1    3  Self-emp-not-inc   83311  ...            0   United-States  <=50K
2    2           Private  215646  ...            2   United-States  <=50K
3    3           Private  234721  ...            2   United-States  <=50K
4    1           Private  338409  ...            2            Cuba  <=50K

[5 rows x 15 columns]

In [46]:
train_set['workclass'].unique() ## workclass is the name of the 2nd column

array(['State-gov', 'Self-emp-not-inc', 'Private', 'Federal-gov',
       'Local-gov', nan, 'Self-emp-inc', 'Without-pay', 'Never-worked'],
      dtype=object)

In [47]:
# how many labels this feature has 
len(train_set['workclass'].unique())

9

In [54]:
columns = ['workclass', 'education', 'marital-status', 'occupation','relationship', 'race', 'sex', 'native-country']

In [64]:
train_set = train_set[columns]

In [65]:
train_set.head()

          workclass  education  ...     sex native-country
0         State-gov  Bachelors  ...    Male  United-States
1  Self-emp-not-inc  Bachelors  ...    Male  United-States
2           Private    HS-grad  ...    Male  United-States
3           Private       11th  ...    Male  United-States
4           Private  Bachelors  ...  Female           Cuba

[5 rows x 8 columns]

In [66]:
# let's see how many categories are there in each and every feature
for feature  in train_set.columns[:]:
    print(feature, ':', len(train_set[feature].unique()),'Labels')

workclass : 9 Labels
education : 16 Labels
marital-status : 7 Labels
occupation : 15 Labels
relationship : 6 Labels
race : 5 Labels
sex : 2 Labels
native-country : 42 Labels

In [67]:
train_set['native-country'].value_counts()

native-country
United-States                 43832
Mexico                          951
Philippines                     295
Germany                         206
Puerto-Rico                     184
Canada                          182
El-Salvador                     155
India                           151
Cuba                            138
England                         127
China                           122
South                           115
Jamaica                         106
Italy                           105
Dominican-Republic              103
Japan                            92
Guatemala                        88
Poland                           87
Vietnam                          86
Columbia                         85
Haiti                            75
Portugal                         67
Taiwan                           65
Iran                             59
Greece                           49
Nicaragua                        49
Peru                             46
Ecuador                          45
France                           38
Ireland                          37
Hong                             30
Thailand                         30
Cambodia                         28
Trinadad&Tobago                  27
Laos                             23
Yugoslavia                       23
Outlying-US(Guam-USVI-etc)       23
Scotland                         21
Honduras                         20
Hungary                          19
Holand-Netherlands                1
Name: count, dtype: int64

In [69]:
# now converting this into dictionary and then map it
country_map = train_set['native-country'].value_counts().to_dict()

In [72]:
# how to replace this above frequency into the dataframe  

train_set['native-country'] = train_set['native-country'].map(country_map)
train_set.head(20)

C:\Users\azhar afridi\AppData\Local\Temp\ipykernel_49348\3503678123.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_set['native-country'] = train_set['native-country'].map(country_map)

           workclass     education  ...     sex native-country
0          State-gov     Bachelors  ...    Male        43832.0
1   Self-emp-not-inc     Bachelors  ...    Male        43832.0
2            Private       HS-grad  ...    Male        43832.0
3            Private          11th  ...    Male        43832.0
4            Private     Bachelors  ...  Female          138.0
5            Private       Masters  ...  Female        43832.0
6            Private           9th  ...  Female          106.0
7   Self-emp-not-inc       HS-grad  ...    Male        43832.0
8            Private       Masters  ...  Female        43832.0
9            Private     Bachelors  ...    Male        43832.0
10           Private  Some-college  ...    Male        43832.0
11         State-gov     Bachelors  ...    Male          151.0
12           Private     Bachelors  ...  Female        43832.0
13           Private    Assoc-acdm  ...    Male        43832.0
14           Private     Assoc-voc  ...    Male            NaN
15           Private       7th-8th  ...    Male          951.0
16  Self-emp-not-inc       HS-grad  ...    Male        43832.0
17           Private       HS-grad  ...    Male        43832.0
18           Private          11th  ...    Male        43832.0
19  Self-emp-not-inc       Masters  ...  Female        43832.0

[20 rows x 8 columns]

#### Advantages and 
1. Easy to use
2. Not increasing feature space (most important thing is this)
#### Disadvantages 
1. It will provide same weight if the frequencies are same. This is the major problem with this type of encoding

#### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by th joint probabilities of being 1 0

In [75]:
import pandas as pd
df = pd.read_csv('tictonic..csv', usecols = ['Cabin', 'Survived'])

In [76]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [77]:
df['Cabin'].fillna('Missing', inplace = True)

In [81]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [85]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [86]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [87]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [88]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [89]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [90]:
# store in a label
ordinal_label = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_label

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [91]:
ordinal_labels2 = {k:i for i, k in enumerate(ordinal_label, 0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [93]:
# maping the cabin column
df['Cabin_ordinal_labels'] = df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

#### Mean Encoding

In [94]:
 df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [96]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [97]:
df['mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854